#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s
module.buckets.aws_s3_bucket_object.delete_company_function_object: Refreshing state... [id=lambdas/demo/delete_company_handler.zip]
module.buckets.aws_s3_bucket_object.register_function_object: Refreshing state... [id=lambdas/demo/register.zip]
module.buckets.aws_s3_bucket_object.message_function_object: Refreshing state... [id=lambdas/demo/message.zip]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.logs.aws_cloudwatch_log_group.register_lambda_function: Refreshing state... [id=/aws/lambda/demo_register_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_details_function_object: Refreshing state... [id=lambdas/demo/get_company_details_handler.zip]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.logs.aws_cloudwatch_log_group.disconnect_lambda_function: Refreshing state... [id=/aws/lambda/demo_disconnect_lambda_function]
module.policy.aws_iam_role.message_lambda_exec_role: Refreshing state... [id=demo_message_lambda_exec_role]
module.policy.aws_iam_role.get_by_metric_report_lambda_exec_role: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/get_edit_modify_data_handler.zip]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.logs.aws_cloudwatch_log_group.edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_edit_modify_data_lambda_function]
module.policy.aws_iam_role.company_investments_lambda_exec_role: Refreshing state... [id=demo_get_company_investments_lambda_exec_role]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.logs.aws_cloudwatch_log_group.get_edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_edit_modify_data_lambda_function]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_report_lambda_function]
module.policy.aws_iam_role.upload_file_s3_lambda_exec_role: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.update_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_update_data_lambda_function]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.buckets.aws_s3_bucket_object.edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/edit_modify_data_handler.zip]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.logs.aws_cloudwatch_log_group.get_by_metric_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_by_metric_report_lambda_function]
module.buckets.aws_s3_bucket_object.add_scenario_function_object: Refreshing state... [id=lambdas/demo/add_scenario_handler.zip]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object: Refreshing state... [id=lambdas/demo/get_by_metric_report_handler.zip]
module.logs.aws_cloudwatch_log_group.get_metric_types_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_types_lambda_function]
module.policy.aws_iam_role.get_investment_year_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_company_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_details_lambda_function]
module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/download_comparison_vs_peers_handler.zip]
module.logs.aws_cloudwatch_log_group.get_company_investments_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_investments_lambda_function]
module.policy.aws_iam_role.delete_scenarios_lambda_exec_role: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_all_public_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_public_companies_lambda_function]
module.network.aws_apigatewayv2_api.websocket_api: Refreshing state... [id=9cd29nbvb8]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.buckets.aws_s3_bucket_object.update_data_function_object: Refreshing state... [id=lambdas/demo/update_data.zip]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.connect_lambda_exec_role: Refreshing state... [id=demo_connect_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.policy.aws_iam_role.validate_data_lambda_exec_role: Refreshing state... [id=demo_validate_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_report_handler.zip]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_investments_function_object: Refreshing state... [id=lambdas/demo/get_company_investments_handler.zip]
module.policy.aws_iam_role.change_user_role_lambda_exec_role: Refreshing state... [id=demo_change_user_role_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.add_investment_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_investment_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.buckets.aws_s3_bucket_object.disconnect_function_object: Refreshing state... [id=lambdas/demo/disconnect.zip]
module.policy.aws_iam_role.add_scenario_lambda_exec_role: Refreshing state... [id=demo_add_scenario_lambda_exec_role]
module.policy.aws_iam_role.get_metric_types_lambda_exec_role: Refreshing state... [id=demo_get_metric_types_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.delete_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_company_lambda_function]
module.policy.aws_iam_role.disconnect_lambda_exec_role: Refreshing state... [id=demo_disconnect_lambda_exec_role]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.policy.aws_iam_role.update_data_lambda_exec_role: Refreshing state... [id=demo_update_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.logs.aws_cloudwatch_log_group.download_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_download_comparison_vs_peers_lambda_function]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.validate_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_validate_data_lambda_function]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.policy.aws_iam_role.get_company_details_lambda_exec_role: Refreshing state... [id=demo_get_company_details_lambda_exec_role]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.policy.aws_iam_role.register_lambda_exec_role: Refreshing state... [id=demo_register_lambda_exec_role]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.delete_company_lambda_exec_role: Refreshing state... [id=demo_delete_company_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_public_companies_handler.zip]
module.policy.aws_iam_role.get_edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.buckets.aws_s3_bucket_object.connect_function_object: Refreshing state... [id=lambdas/demo/connect.zip]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_options_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.message_lambda_function: Refreshing state... [id=/aws/lambda/demo_message_lambda_function]
module.buckets.aws_s3_bucket_object.change_user_role_function_object: Refreshing state... [id=lambdas/demo/change_user_role_handler.zip]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object: Refreshing state... [id=lambdas/demo/get_dynamic_report_handler.zip]
module.logs.aws_cloudwatch_log_group.connect_lambda_function: Refreshing state... [id=/aws/lambda/demo_connect_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.logs.aws_cloudwatch_log_group.delete_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.change_user_role_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_user_role_lambda_function]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_options_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.policy.aws_iam_role.get_all_public_companies_lambda_exec_role: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role]
module.buckets.aws_s3_bucket_object.delete_scenarios_function_object: Refreshing state... [id=lambdas/demo/delete_scenarios_handler.zip]
module.logs.aws_cloudwatch_log_group.upload_file_s3_lambda_function: Refreshing state... [id=/aws/lambda/demo_upload_file_s3_lambda_function]
module.policy.aws_iam_role.get_dynamic_report_lambda_exec_role: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role]
module.policy.aws_iam_role.edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.policy.aws_iam_role.download_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.validate_data_function_object: Refreshing state... [id=lambdas/demo/validate_data_handler.zip]
module.buckets.aws_s3_bucket_object.add_investment_function_object: Refreshing state... [id=lambdas/demo/add_investment_handler.zip]
module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_options_lambda_function]
module.policy.aws_iam_role.add_investment_lambda_exec_role: Refreshing state... [id=demo_add_investment_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.logs.aws_cloudwatch_log_group.add_scenario_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_scenario_lambda_function]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.buckets.aws_s3_bucket_object.upload_file_s3_function_object: Refreshing state... [id=lambdas/demo/upload_file_s3_handler.zip]
module.buckets.aws_s3_bucket_object.get_metric_types_function_object: Refreshing state... [id=lambdas/demo/get_metric_types_handler.zip]
module.logs.aws_cloudwatch_log_group.get_dynamic_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_dynamic_report_lambda_function]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_resource.by_metric_report: Refreshing state... [id=890crw]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=8rc63h]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.dynamic_report: Refreshing state... [id=7ce5jh]
module.network.aws_api_gateway_resource.edit_modify: Refreshing state... [id=qybsqa]
module.network.aws_api_gateway_resource.investments: Refreshing state... [id=bumysj]
module.network.aws_api_gateway_resource.investment_report: Refreshing state... [id=iew1mv]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.upload_file_s3: Refreshing state... [id=u4or2w]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_logs: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704618600000003]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_vpc: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704613000000001]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_vpc: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648074600000001]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_logs: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648088100000002]
module.policy.aws_iam_role_policy_attachment.message_lambda_logs: Refreshing state... [id=demo_message_lambda_exec_role-20220420120428768600000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_vpc: Refreshing state... [id=demo_message_lambda_exec_role-20220503145603314500000002]
module.network.aws_apigatewayv2_stage.stage: Refreshing state... [id=demo]
module.policy.aws_iam_role_policy.upload_file_s3_policy: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role:demo_upload_file_s3_policy]
module.policy.aws_iam_role_policy_attachment.upload_file_s3_lambda_logs: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role-20220411202109965800000001]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.connect_lambda_logs: Refreshing state... [id=demo_connect_lambda_exec_role-20220420102338091900000002]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_logs: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163628999400000001]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_vpc: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163629032800000002]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_logs: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436404000000002]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_vpc: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436359500000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_vpc: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729143000000002]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_logs: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729123500000001]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_vpc: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127271200000001]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_logs: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127368000000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_vpc: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150845149600000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_logs: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150846115600000002]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_logs: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220420102337857000000001]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_vpc: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220503145603304000000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_logs: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627405600000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_vpc: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627406700000002]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_vpc: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154817160700000002]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_logs: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154816818700000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_logs: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204628035400000002]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_vpc: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204627925600000001]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_vpc: Refreshing state... [id=demo_register_lambda_exec_role-20220503143910016300000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_logs: Refreshing state... [id=demo_register_lambda_exec_role-20220427122624952100000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_logs: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119943200000002]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_vpc: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119918000000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_logs: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403233500000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_vpc: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403266900000002]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_vpc: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628072200000003]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_logs: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628159500000004]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.network.aws_api_gateway_resource.by_metric_report_id: Refreshing state... [id=f4ao8c]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.network.aws_api_gateway_resource.metric_types: Refreshing state... [id=qg9lk5]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=7kq045]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_logs: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212705003500000004]
module.network.aws_api_gateway_resource.dynamic_report_id: Refreshing state... [id=1c508f]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_vpc: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212704618600000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_logs: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143305700000001]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_vpc: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143307800000002]
module.network.aws_api_gateway_resource.investment_report_id: Refreshing state... [id=ieupa8]
module.network.aws_api_gateway_resource.invest_year_options: Refreshing state... [id=gq814s]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_vpc: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328473300000001]
module.network.aws_api_gateway_resource.company_investments: Refreshing state... [id=jd2xz9]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_logs: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328477200000002]
module.network.aws_api_gateway_resource.validate_data: Refreshing state... [id=pi6a5s]
module.network.aws_api_gateway_resource.company_details: Refreshing state... [id=hper4a]
module.network.aws_api_gateway_resource.public_companies: Refreshing state... [id=4v8ab4]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_logs: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117408200000002]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_vpc: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117152800000001]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744896400000001]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744901200000002]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:13]
module.network.aws_api_gateway_resource.user_roles: Refreshing state... [id=npbrdw]
module.network.aws_api_gateway_resource.download_comparison_vs_peers: Refreshing state... [id=zgaw7c]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=0bc6fs]
module.policy.aws_iam_role_policy.allow_execute_api_register_connection: Refreshing state... [id=demo_register_lambda_exec_role:demo_allow_execute_api_register_connection_policy]
module.policy.aws_lambda_permission.websocket_register: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_disconnect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_message: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_iam_role_policy.allow_execute_api_message_connection: Refreshing state... [id=demo_message_lambda_exec_role:demo_allow_execute_api_message_connection_policy]
module.policy.aws_lambda_permission.websocket_connect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.functions.aws_lambda_function.connect_lambda_function: Refreshing state... [id=demo_connect_lambda_function]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.disconnect_lambda_function: Refreshing state... [id=demo_disconnect_lambda_function]
module.functions.aws_lambda_function.message_lambda_function: Refreshing state... [id=demo_message_lambda_function]
module.functions.aws_lambda_function.get_investment_year_options_lambda_function: Refreshing state... [id=demo_get_investment_year_options_lambda_function]
module.functions.aws_lambda_function.validate_data_lambda_function: Refreshing state... [id=demo_validate_data_lambda_function]
module.functions.aws_lambda_function.add_investment_lambda_function: Refreshing state... [id=demo_add_investment_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_metric_types_lambda_function: Refreshing state... [id=demo_get_metric_types_lambda_function]
module.functions.aws_lambda_function.upload_file_s3_lambda_function: Refreshing state... [id=demo_upload_file_s3_lambda_function]
module.functions.aws_lambda_function.register_lambda_function: Refreshing state... [id=demo_register_lambda_function]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.functions.aws_lambda_function.update_data_lambda_function: Refreshing state... [id=demo_update_data_lambda_function]
module.functions.aws_lambda_function.get_company_investments_lambda_function: Refreshing state... [id=demo_get_company_investments_lambda_function]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.policy.aws_iam_role_policy.get_dynamic_report_cognito_policy: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role:demo_get_dynamic_report_cognito_policy]
module.policy.aws_iam_role_policy.get_universe_overview_cognito_policy: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role:demo_get_universe_overview_cognito_policy]
module.policy.aws_iam_role_policy.delete_scenarios_cognito_policy: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role:demo_delete_scenarios_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.edit_modify_data_cognito_policy: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role:demo_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.assign_company_permissions_cognito_policy: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role:demo_assign_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.change_user_role_cognito_policy: Refreshing state... [id=demo_change_user_role_lambda_exec_role:demo_change_user_role_cognito_policy]
module.policy.aws_iam_role_policy.get_by_metric_report_cognito_policy: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role:demo_get_by_metric_report_cognito_policy]
module.policy.aws_iam_role_policy.download_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role:demo_download_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_company_permissions_cognito_policy: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role:demo_get_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_edit_modify_data_cognito_policy: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role:demo_get_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.delete_company_cognito_policy: Refreshing state... [id=demo_delete_company_lambda_exec_role:demo_delete_company_cognito_policy]
module.policy.aws_iam_role_policy.change_company_publicly_cognito_policy: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role:demo_change_company_publicly_cognito_policy]
module.policy.aws_iam_role_policy.add_scenario_cognito_policy: Refreshing state... [id=demo_add_scenario_lambda_exec_role:demo_add_scenario_cognito_policy]
module.policy.aws_iam_role_policy.get_company_details_cognito_policy: Refreshing state... [id=demo_get_company_details_lambda_exec_role:demo_get_company_details_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_year_report_cognito_policy: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role:demo_get_investment_year_report_cognito_policy]
module.policy.aws_iam_role_policy.get_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role:demo_get_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_company_report_vs_peers_cognito_policy: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role:demo_get_company_report_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_all_public_companies_cognito_policy: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role:demo_get_all_public_companies_cognito_policy]
module.functions.aws_lambda_function.get_company_details_lambda_function: Refreshing state... [id=demo_get_company_details_lambda_function]
module.functions.aws_lambda_function.get_investment_year_report_lambda_function: Refreshing state... [id=demo_get_investment_year_report_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_dynamic_report_lambda_function: Refreshing state... [id=demo_get_dynamic_report_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_by_metric_report_lambda_function: Refreshing state... [id=demo_get_by_metric_report_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_all_public_companies_lambda_function: Refreshing state... [id=demo_get_all_public_companies_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.change_user_role_lambda_function: Refreshing state... [id=demo_change_user_role_lambda_function]
module.functions.aws_lambda_function.edit_modify_data_lambda_function: Refreshing state... [id=demo_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.delete_scenarios_lambda_function: Refreshing state... [id=demo_delete_scenarios_lambda_function]
module.functions.aws_lambda_function.add_scenario_lambda_function: Refreshing state... [id=demo_add_scenario_lambda_function]
module.functions.aws_lambda_function.get_edit_modify_data_lambda_function: Refreshing state... [id=demo_get_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.delete_company_lambda_function: Refreshing state... [id=demo_delete_company_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_apigatewayv2_integration.disconnect_integration: Refreshing state... [id=usm7qx9]
module.network.aws_apigatewayv2_integration.register_integration: Refreshing state... [id=qzrgtru]
module.network.aws_apigatewayv2_integration.message_integration: Refreshing state... [id=bwwsvap]
module.network.aws_apigatewayv2_integration.connect_integration: Refreshing state... [id=lov27i5]
module.network.aws_api_gateway_method.get_metric_types_method: Refreshing state... [id=agm-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_method.get_by_metric_report_method: Refreshing state... [id=agm-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_method.dynamic_report_method: Refreshing state... [id=agm-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_method.get_company_details_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.validate_data_method: Refreshing state... [id=agm-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_method.get_investment_year_report_method: Refreshing state... [id=agm-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_method.delete_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.delete_company_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.change_user_role_method: Refreshing state... [id=agm-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.upload_file_s3_method: Refreshing state... [id=agm-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_method.add_scenario_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_method.download_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_method.get_company_investments_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_method.get_all_public_companies_method: Refreshing state... [id=agm-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_method.add_investment_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_method.get_investment_year_options_method: Refreshing state... [id=agm-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_apigatewayv2_route.connect_route: Refreshing state... [id=lb55rfq]
module.network.aws_api_gateway_integration.get_metric_types_integration: Refreshing state... [id=agi-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.dynamic_report_integration: Refreshing state... [id=agi-kb7gblbu69-1c508f-GET]
module.network.aws_apigatewayv2_route.register_route: Refreshing state... [id=f5rytev]
module.network.aws_api_gateway_integration.by_metric_report_integration: Refreshing state... [id=agi-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_integration.get_company_details_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-GET]
module.network.aws_apigatewayv2_route.disconnect_route: Refreshing state... [id=i6ilvcd]
module.network.aws_apigatewayv2_route.message_route: Refreshing state... [id=b6359n3]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.validate_data_integration: Refreshing state... [id=agi-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.investment_report_integration: Refreshing state... [id=agi-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_integration.delete_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_integration.change_user_role_integration: Refreshing state... [id=agi-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.delete_company_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.upload_file_s3_integration: Refreshing state... [id=agi-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.get_edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.add_company_scenario_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_integration.company_investments_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_integration.edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_integration.download_comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_integration.public_companies_integration: Refreshing state... [id=agi-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_integration.add_investment_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_integration.invest_year_options_integration: Refreshing state... [id=agi-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_apigatewayv2_deployment.deploy: Refreshing state... [id=ey3sgf]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_get_company_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_all_public_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_add_investment_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_get_dynamic_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_add_scenario_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_investment_year_options_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_validate_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayValidateData]
module.policy.aws_lambda_permission.apigw_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_delete_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_company_investments_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyInvestmentsId]
module.policy.aws_lambda_permission.apigw_change_user_role_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeUserRole]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_download_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_delete_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_upload_file_s3_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayUploadFileS3]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_by_metric_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_investment_year_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_metric_types_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "6a9424db4e245001221fd92c30579ffa" -> "802fa6ddb7f610ece217828d9de7aabb"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5fba1ecb52ae2fedafcd05f7ddb3b55f" -> "911f47599b53f85fbe1e48f8b0f71416"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "a00edbe62f1ff10c011fb0660956da02" -> "12ac5eaaa6dabcd4e24a5df0b5653631"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "5af5501952c83c2b136698d2fa88d739" -> "e266d97a8fa2e67555a2ce3965f3793c"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "97c67d5b29fdabc764b53a618e84f8b8" -> "3e068b07647415817e8e6a88e0d77b70"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "316c636b114a22351b592c1c0daddeea" -> "cfc8204acf00e343daa40a6ae98ba48c"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "9c0853b1866cc87ed3f3c383c5e1062b" -> "07fe26c9d6b1498df44c9f40c76caf94"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "6cf1ea0377f97a28d83cf5031c485076" -> "dfbc45e7c7faeed1047a74abe22bdc57"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "c26333610a9256e517f54745554c8e6d" -> "32cba9fe2bfad08db6897fc747879bbc"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "52e9d6349e265c77b1116347eadb6e2e" -> "f74b2e35d50af96f4ab4a299e2825d2f"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "1a84b8773b69d76a7b3238d0340bd72b" -> "5488ded6bbd8e0a3d25f4893bfd2f9cf"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "9e48440397c2ea703395fa2e1ffa3811" -> "45b28c80577e0409e6279ac2aa93f71b"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "327253aef2f2e78a770e2c5ddb6af113" -> "02be03317ff70def31423f74b6d78512"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "051fadaa251cca1c0141ad4c357c70df" -> "38de4cdc5a6c892eb4506681864a63c3"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "b4ee8edacafd98fa6d6ae6c731a87c08" -> "401a49ce3f51870553e4c3e3cf8f7407"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "c82cc61cfe2955ba63aceedadfdda9a8" -> "018e4a0f19d0977308c303dec6926687"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "5bf538d051e85987761221cb5086718b" -> "8171accf178c418d18675f53bec49369"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "d73cddd0fbb4c4892a3087a37f06e528" -> "d6200ca7f3b7820a21364991259716c0"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "16bd7231fc3028ff3edc86283c3adb27" -> "58962d572c695e11a42e62cc9de4befa"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "b6bb3d22388d1929fb9262021b9520e6" -> "51c16d85e0d36b61debc5689018a6539"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6575d97289a398555dbcf7f783919a81" -> "445cadf4f1120ab1747de3cf83d52e7f"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "8bdc51763e339e71dfee72ca63bacc46" -> "e706c3a75b387d076d995fee8c5f3e2c"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "cce352c43a47012f14c5fe4cf6838378" -> "08dd816b117ee5e1c285e6f20d30ac3d"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      ~ etag               = "5e25aba3c41788600818402a7560baf4" -> "7677555bef8b4ab280d73276eef987e0"
        id                 = "lambdas/demo/get_investment_year_options_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      ~ etag               = "4433b0cfe8a6f112211820a112996a2d" -> "ae5973f82608e76307b1cadaab6156e7"
        id                 = "lambdas/demo/get_investment_year_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "263b288b66ad2f6ef2339a053e435746" -> "5924ab230fce1baee8b963afeda94d6d"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "a18d1a26d58195af13af5779092e6745" -> "db06bf34014cdf399868ac47a7bec6d2"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d33a313e59e37b956c6314ab46c05869" -> "1b7fc44a808c6be7685f37135bcb44e5"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f74adff3a0441f941be35e369db78310" -> "cd21061a8c811a95cd839202e56e6e41"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "08365e1e0d5da58ef0b2058522f6d111" -> "6e2b059bce1166afd81079b0fab4d503"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "f732e397e4420b393e205324a393b965" -> "8b38fcaafbe4f1be0b0f42734a8e5d66"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "16f58b687cc6b253b6c5f31ca2ea704c" -> "52af6eaae57e600b9b7426c1ec2724a7"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "de6e4deaaf222d013ec89b0c31e87ab1" -> "aaa494e39fd7de60cedf64291196e820"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "229d821de912aedbf31c264767e31854" -> "35bee568e1cc0f2c57b0aeb53daad479"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "902b919e0ffc6e52cd4f06d452454652" -> "8a81fd66f9472c65e44826781dbfa3ec"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "9b1456c5581589f9233b35da635dea00" -> "0c965d7c14a6bf221f977b7de0b951fa"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "471fedbc03eaeeef631d1377ba54c369" -> "9b5c0957631913de168f0c5fa676abb9"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "a8695d05aa1f1ccd3a89729be1b27d6a" -> "658bf8f39268e9bde866de262b7c3a31"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "jVMI3Atr8UUbCon1fTco1QbETzTOfkmFqgHq8gYhSLw=" -> "EzwLXJjnpNeyzRRfWR4INCuRR/qQK3nFG2SMeo9wcBY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "9/SlARYjtlF89GhDMYdv75SlbdUsJ12DG7rtAhbEhfo=" -> "DIM5kmE4HiVtG3h/gp0RcvL3Rcy4BwhNP2odI8OeK1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "tKXWcIsCfbaJy4WkHbZiMrHnadv0XkHS6LrWK8aJJII=" -> "WmzAtScWMmoE+Mz1KYz4cJaBVDa8+DHqJBioT1WITo0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "uWG4ips7L0D6EWuBJmBTnCI/rpC/OE9W4eL7JXpb8DI=" -> "+IpZtk7WTIJDTLJhSJMXPLnG+0450/Rjg1bKin7dsOs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "M28hW7uIYWOW2PB+m7E9aAz5WfMJETxcK2XFYZEGo+o=" -> "kyQCzmeFNGiOQIv3wJlessenRBq8xNkO9nspi270kn8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "nEMcxZ74yZDMpro5s/VyeR+ARbYYIx56sXiE3tTdfJY=" -> "GPkNaZLK1o9NMES6HJfhVjsx56uV/Xg13lc4TDL+rsI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "tv/MxeMQ3Jg1tjEJW4F+HpkfXSH6bCfBetMPEWg5zOI=" -> "oeNbuGPDlAorcr29cXqW7lHIZzh3FDKIofeJ8nTu2X0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "x4p/objSwkHCLXFchY3R7z1rJgNwxseu1ExXHsSvenI=" -> "BuwL7he2I03onakIfixvlalRBL5n+cr0H4Riu/fiTdI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "qrO9rmFNMrRZQl1askP6Z+U7uXXl6XbtSXezX0TcjQg=" -> "6rkZ4nHOdfTkl7gZlwAhddl6janZgXf+M6oEimmt3gg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "MLSr+m6eT8CC0rtmeIOqPVps3ql34Ekzqnd1LsGMuk4=" -> "bD+u9OVmxny32DDklq4PR4MuI7ag3fYdSV425PFL2EU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "KywBkxi2bygiIeDFHuIMo32VW/ZBTyYeL2wFBEyG7kg=" -> "lyyu+xxq4LXSs1WSkZ/Piicgg1rPmSkqIa2LwJ31/Qc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ANG1xuuROH4oEl5ggGMPzCtIZAjoVOZlPqbpVBQ6VXk=" -> "FicZkCIC95UdNeLJLs9QLt0tKnmVLxpnPNfJ1sIKAVk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y+wd7iKpYSZv/cP+361YZToRT8IX2V+T4mILTBjMfqM=" -> "vLNQO4uWLDNBhE61njTdtDScV5TIxKA6yjY0BwEZne4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "Un9E42Na2vyhUbX0wCERVQEWOJ7KF2S/RLvaf5foy50=" -> "ZaWfbdEMnDxPBGBNgRG/HVwARxD8/dx5LicDr3xfOcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Fh315C3UZoZl7FShxCAiJfBdAXMhvexDj/6Rh/h4hw8=" -> "RCyDxl7OeldD7Va+JcH37j5loQmHr0H7N9GI1r1ePn0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-08-01T15:18:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "/+Ng7SYezkOJhUUOsCcUc0ng2B7JQzXwjdoA5oV0BYM=" -> "uhKBtxdElf6E/U6ZWmjOfVPSbR2hY/MP4k6Q8mDWSWI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "gdiN6JQ0TuxNY4t2musRm+1rkZ5L4z6JKlDX/Wvf534=" -> "QMNKJc+Cg1sL06r/IomLduooJgUSgTps3ntB7mPyuyk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "LI22ZegiYNHZrb5bMImB1TlXQUdcbZvJGqd4vooXoZY=" -> "dzx8sSB1t/0iStzgimlPB9Bn2BVz3AZcBx4GSm1w3tM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bl5Dcx/RC4cH4tHAqWPZJXNkhAm+5BSU6FtMtj4muSY=" -> "FB4pcJ1dCwDwdUgzDiicKzc2pJtE+9xWKcLi/l/AkzY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "dotWfflUwMPC8T2q7dyk/AmHUgwHzL7hSFB+qo88lI8=" -> "zGrruPdO5iC3UTjWmNUZrwKQdWPxEau7Ha7msnbuwNw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "5L7ZKTvCW5yrR3Rv28hluD+4vDunO4wo/4bOY0vYqIQ=" -> "9hQU78SvnuPbZdQDj3Jc1sD/eALmVdef5f20iE16naA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "qT3DxdWBEFJF8iuaZ1HMxdndSXah3LA5PFcsP1z43EI=" -> "3QQqotgwpS0eEutyG3iej99nImWTROavBacMtp5rofA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "tJb6KwWRkco97yunRP8WmMCEQnkOtEBkKBG1M12zkww=" -> "MSFlDYPRNRgO4BLyuLHBAs/ifVWXxbUzx6n0SdrJTOE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
        id                             = "demo_get_investment_year_options_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "C/M1duNR2xPN9isNR6LZOkoPiu3z3PYOaqMt08oSp9Y=" -> "nsKHd5Njz6DG2opzW5rddMYOd3eZnmBtY1T1bCerv5k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
        id                             = "demo_get_investment_year_report_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "vCXE8up1yWOGFwJHCNXndoKp0YUZFYppA+jdhOhe1SU=" -> "lTjif16/HXyEw2LkosT6tOb3lxQ6iD9UkFvww/NUHaQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "eWX9DOz5SKkf1sge5y5Dd3QwOoIlJxD7xN9TASYGZAE=" -> "7aPNRDACI9BE3ZvTbqnUSdr0YuV5YlE/C0yKCcPCJ9U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "tplCIrA9L84/xjAMpWDHcsFjHMqn4yUNfE5Fe/SbaR8=" -> "EwPHP+05EKcNffAgempi24H4KcYCNuympJp/BEfMVb8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bnunn1qu/YjwN9S4O+6R2JiDoUXzh1ALTVeTnJJqhvk=" -> "TayAe6Ue5q5PXVHPvx0dAYifcwCErX60euMCcGmswqc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "j9rUJRZ0OviJG7RoVqGVVnSskwg0H2czjYF2Fom0W1g=" -> "DnEE4xrQWBI0+nf+gluTpNxEW8wSMhPOX1sCiZ/Y1OI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "5BrCsWrTuVy23z++1J2SvHQkeAG5Pnd0nddYpb08fYE=" -> "XiakFr4mmKRpfTP93RTVb/zMRBNc93+86fPM1TAgJ18="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "svxg1hVY22iWqT1QJAW1r99Ns3gyQbBpSz2v/8Dl7O4=" -> "sRlue8KdGDSsiSEm1e5P1UpZFv0zlB8wp7boG80KqSE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "M0ua3UG5N1mqx6gGKu5WTiobh/ZlPa4Z5WiCR6WXj8c=" -> "/bNKCLb86SJZQ/ntaAQ4LCDjUJNLToRzyBUBt4rIzGI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "WPZ8Ljo33RZsjh4GrI086vpNAhyJPTUGIT1DzN3TPWU=" -> "IK75YkGDZKGwVxgbpWZMvgZCUmxqjuFJ6rGl3U2W+60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "lZyKkR3auAPTu6YMX4SFJbWlyYr429pySCbWQsXqxUA=" -> "VuOngMAczuGUVx04tE56OTG+/3UhhSJnRC0+bqSDH5Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mr2nwJDKcdCVFQkCCRSYZf/yzg649rX2TrU0nrY/nSw=" -> "Vb2J2Lef6eZEKQeZE2qHw4zo6XQ54reMfC4FAHp83X8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-07-22T13:30:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "gNzxHf3cnbCqLDC+Ns5+29DLm1RsUL0ImAKYMFCCa/Y=" -> "f2cLX3Z/dQIVs/sLokvOpPpDh6wuAyYqEmd2mH6ony8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-07-22T13:31:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ty20QRgt5t46yma9og4ynO+YdOCIRY4cV475AicyB8E=" -> "zubOHm3r1tjtgRrJXedIdWTjkYfgmHTPZgfptow3MNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-07-22T13:30:36Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7kq045" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-07-22T13:30:35Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-07-22T13:30:34Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 77 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*